In [1]:
import sqlite3

In [13]:
conn = sqlite3.connect("flights.db")

In [14]:
cur = conn.cursor()

In [4]:
cur.execute("SELECT * from airports limit 5;")

In [5]:
results = cur.fetchall()
print(results)

[(0, '1', 'Goroka', 'Goroka', 'Papua New Guinea', 'GKA', 'AYGA', '-6.081689', '145.391881', '5282', '10', 'U', 'Pacific/Port_Moresby'), (1, '2', 'Madang', 'Madang', 'Papua New Guinea', 'MAG', 'AYMD', '-5.207083', '145.7887', '20', '10', 'U', 'Pacific/Port_Moresby'), (2, '3', 'Mount Hagen', 'Mount Hagen', 'Papua New Guinea', 'HGU', 'AYMH', '-5.826789', '144.295861', '5388', '10', 'U', 'Pacific/Port_Moresby'), (3, '4', 'Nadzab', 'Nadzab', 'Papua New Guinea', 'LAE', 'AYNZ', '-6.569828', '146.726242', '239', '10', 'U', 'Pacific/Port_Moresby'), (4, '5', 'Port Moresby Jacksons Intl', 'Port Moresby', 'Papua New Guinea', 'POM', 'AYPY', '-9.443383', '147.22005', '146', '10', 'U', 'Pacific/Port_Moresby')]

In [6]:
cur.close()
conn.close()

In [7]:
import pandas as pd
import sqlite3

In [8]:
conn = sqlite3.connect("flights.db")
df = pd.read_sql_query("select * from airlines;", conn)
df

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N
...,...,...,...,...,...,...,...,...,...
6043,6043,19828,Vuela Cuba,Vuela Cuba,6C,6CC,None,Cuba,Y
6044,6044,19830,All Australia,All Australia,88,8K8,None,Australia,Y
6045,6045,19831,Fly Europa,None,ER,RWW,None,Spain,Y
6046,6046,19834,FlyPortugal,None,PO,FPT,FlyPortugal,Portugal,Y
6047,6047,19845,FTI Fluggesellschaft,None,None,FTI,None,Germany,N

In [9]:
df['country']

0                 None
1        United States
2         South Africa
3       United Kingdom
4               Russia
             ...
6043              Cuba
6044         Australia
6045             Spain
6046          Portugal
6047           Germany
Name: country, Length: 6048, dtype: object

In [10]:
from datetime import datetime

In [11]:
df = pd.DataFrame(
[[1, datetime(2016, 9,29,9,9),datetime(2016, 9,29,12,0), 'T1', 1]],columns=['id', 'departure', 'arrival', 'number', 'route_id']
)

In [18]:
cur = conn.cursor()
cur.execute("create table daily_flights (id integer, departure date, arrival date, number text, route_id integer)")
conn.commit()

df.to_sql("daily_flights", conn, if_exists="replace")

In [19]:
pd.read_sql_query("select * from daily_flights;", conn)

   index  id            departure              arrival number  route_id
0      0   1  2016-09-29 09:09:00  2016-09-29 12:00:00     T1         1

In [20]:
cur.execute("alter table airlines add column airplanes integer;")

In [21]:
pd.read_sql_query("select * from airlines limit 1", conn)

   index id            name alias iata  icao callsign country active airplanes
0      0  1  Private flight    \N    -  None     None    None      Y      None

In [22]:
df = pd.read_sql("select * from daily_flights", conn)
df["delay_minutes"] = None
df.to_sql("daily_flights", conn, if_exists="replace")